Revit 2024 API
FormatOptions.GetSymbolTypeId Method
 Gets the identifier of the symbol indicating the unit quantifying the value.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public ForgeTypeId GetSymbolTypeId()
Visual Basic
Public Function GetSymbolTypeId As ForgeTypeId
Visual C++
public:
ForgeTypeId^ GetSymbolTypeId()
Return Value
 The symbol identifier. An empty identifier string indicates no symbol.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  UseDefault is true in this FormatOptions.
See Also
FormatOptions Class
Autodesk.Revit.DB Namespace